Show / Hide Table of Contents
Class BIMItemsGroup
Inheritance
System.Object
BIMItemsGroup
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[DataContract]
public class BIMItemsGroup
Properties
Improve this Doc   View Source
Id
Declaration
[DataMember]
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Items
Declaration
[DataMember]
public List<BIMItemId> Items { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<BIMItemId>
Improve this Doc   View Source
Type
Declaration
[DataMember]
public RequestedItemsType Type { get; set; }
Property Value
 Type |  Description
 RequestedItemsType
 Improve this Doc
 View Source